# Part 9

In [3]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.5.3
1.24.1

# Persiapan Data Frame

In [4]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1,20,size=(n_rows,n_cols)),columns=cols)
df

    A   B   C   D   E
0   6   4   5   3  14
1  14  13  13   9   1
2   2  12  19   9  13
3   8  18   5  13   6
4  18   1   7  16  17
5  19   9  10  12  12
6   4  14   6  13  18
7  17   9  10  13  17
8   7   6  17   3  16
9   5   7  15   5  19

# Membagi Data Frame Menjadi Dua Secara Acak Berdasarkan Proposi Tertentu

In [5]:
df.shape

(10, 5)

In [6]:
proporsi = 0.7

df_1 = df.sample(frac=proporsi)
df_2 = df.drop(df_1.index)

print(f"df_1 shape = {df_1}")
print(f"df_2 shape = {df_2}")

df_1 shape =     A   B   C   D   E
9   5   7  15   5  19
2   2  12  19   9  13
3   8  18   5  13   6
8   7   6  17   3  16
0   6   4   5   3  14
1  14  13  13   9   1
7  17   9  10  13  17
df_2 shape =     A   B   C   D   E
4  18   1   7  16  17
5  19   9  10  12  12
6   4  14   6  13  18

In [7]:
df_1

    A   B   C   D   E
9   5   7  15   5  19
2   2  12  19   9  13
3   8  18   5  13   6
8   7   6  17   3  16
0   6   4   5   3  14
1  14  13  13   9   1
7  17   9  10  13  17

In [8]:
df_2

    A   B   C   D   E
4  18   1   7  16  17
5  19   9  10  12  12
6   4  14   6  13  18